 # list
odd = [1,3,5,7,9]

a = []              # a = list()
b = [1.2.3]
c = ['Life','is','too','short']
d = [1,2,'Life','is']
e = [1,2,['Life','is']]

# Indexing
a = [1,2,3]
a[0]            #1
a[0] + a[2]     #4
a[-1]           #3

a = [1,2,3,['a','b','c']]
a[-1]           #['a','b','c']

a[-1][0]        #'a'

# Slicing
a = [1,2,3,4,5]
a[0:2]          #[1,2]
a[:2]           #[1,2]
a[2:]           #[3,4,5]

# 더하기
a = [1,2,3]
b = [4,5,6]
a+b             #[1,2,3,4,5,6]

# 반복
a = [1,2,3]
a * 3           #[1,2,3,1,2,3,1,2,3]

# 길이 구하기
a = [1,2,3]
len(a)          #3

# 수정
a = [1,2,3]
a[2] = 4
a               #[1,2,4]

# 삭제
a = [1,2,3]
del a[1]
a               #[1,3]

a = [1,2,3,4,5]
del a[2:]
a               #[1,2]

# append()
a = [1,2,3]
a.append(4)
a               #[1,2,3,4]

a.append([5,6])
a               #[1,2,3,4,[5,6]]

# reverse()
a = ['a','c','b']
a.reverse()
a               #['b','c','a']

# index()
a = [1,2,3]
a.index(3)      #2
a.index(1)      #0

# insert()
a = [1,2,3]
a.insert(0,4)
a               #[4,1,2,3]

# remove()
a = [1,2,3,1,2,3]
a.remove(3)
a               #[1,2,1,2,3]  remove(x)<- 첫번째 나오는 x를 삭제

# pop()
a = [1,2,3]
a.pop()
a               #[1,2]

# count()
a = [1,2,3,1]
a.count(1)      #2

# extend()
a = [1,2,3]
a.extend([4,5])
a               #[1,2,3,4,5]
b = [6,7]
a.extenc(b)
a               #[1,2,3,4,5,6,7]
